In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import xgboost as xgb

In [27]:
df = pd.read_csv("../data/Groceries_dataset.csv")
items_array = df["itemDescription"].unique()
print("Number of unique items:", len(items_array))

Number of unique items: 167

In [29]:
df.head()

   Member_number        Date   itemDescription
0           1808  21-07-2015    tropical fruit
1           2552  05-01-2015        whole milk
2           2300  19-09-2015         pip fruit
3           1187  12-12-2015  other vegetables
4           3037  01-02-2015        whole milk

In [40]:
df.set_index("Date").head()

            Member_number   itemDescription
Date
21-07-2015           1808    tropical fruit
05-01-2015           2552        whole milk
19-09-2015           2300         pip fruit
12-12-2015           1187  other vegetables
01-02-2015           3037        whole milk

In [42]:
df.Member_number = 1808
df

       Member_number        Date        itemDescription
0               1808  21-07-2015         tropical fruit
1               1808  05-01-2015             whole milk
2               1808  19-09-2015              pip fruit
3               1808  12-12-2015       other vegetables
4               1808  01-02-2015             whole milk
...              ...         ...                    ...
38760           1808  08-10-2014          sliced cheese
38761           1808  23-02-2014                  candy
38762           1808  16-04-2014               cake bar
38763           1808  03-12-2014  fruit/vegetable juice
38764           1808  26-12-2014               cat food

[38765 rows x 3 columns]